log/coresched_128.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 10816.61 qps: 173776.27 (r/w/o: 152016.67/0.00/21759.60) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 3558.36 qps: 57029.89 (r/w/o: 49913.18/0.00/7116.72) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 5324.89 qps: 85316.34 (r/w/o: 74666.55/0.00/10649.79) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 6502.98 qps: 103936.75 (r/w/o: 90929.79/0.00/13006.95) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 3334.97 qps: 53387.41 (r/w/o: 46717.48/0.00/6669.93) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 2263.60 qps: 36281.50 (r/w/o: 31757.30/0.00/4524.20) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 4938.99 qps: 79018.81 (r/w/o: 69137.82/0.00/9880.99) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 10331.72 qps: 165043.94 (r/w/o: 144380.51/0.00/20663.43) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 3321.15 qps: 53245.56 (r/w/o: 46603.26/0.00/6642.30) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 3173.09 qps: 50745.52 (r/w/o: 44405.32/0.00/6340.20) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            752528
        write:                           0
        other:                           107504
        total:                           860032
    transactions:                        53752  (5282.14 per sec.)
    queries:                             860032 (84514.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5282.1403
    time elapsed:                        10.1762s
    total number of events:              53752

Latency (ms):
         min:                                    1.27
         avg:                                   24.02
         max:                                  945.77
         95th percentile:                      101.13
         sum:                              1290910.06

Threads fairness:
    events (avg/stddev):           419.9375/51.53
    execution time (avg/stddev):   10.0852/0.05