log/default_128.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 117.55 qps: 3093.07 (r/w/o: 2730.47/0.00/362.60) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 581.71 qps: 9052.02 (r/w/o: 7873.59/0.00/1178.44) lat (ms,95%): 1050.76 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 26999.77 qps: 432190.79 (r/w/o: 378207.14/0.00/53983.65) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 11475.35 qps: 183659.88 (r/w/o: 160712.19/0.00/22947.70) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 13296.87 qps: 212645.89 (r/w/o: 186051.16/0.00/26594.74) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 14133.25 qps: 226040.71 (r/w/o: 197773.21/0.00/28267.50) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 27544.31 qps: 440821.99 (r/w/o: 385735.37/0.00/55086.61) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 13830.13 qps: 221184.22 (r/w/o: 193525.95/0.00/27658.27) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 16497.90 qps: 264071.43 (r/w/o: 231079.62/0.00/32991.81) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 10945.60 qps: 175123.56 (r/w/o: 153227.37/0.00/21896.19) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1899086
        write:                           0
        other:                           271298
        total:                           2170384
    transactions:                        135649 (13118.13 per sec.)
    queries:                             2170384 (209890.15 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      13118.1344
    time elapsed:                        10.3406s
    total number of events:              135649

Latency (ms):
         min:                                    1.55
         avg:                                    9.35
         max:                                 1737.83
         95th percentile:                       15.27
         sum:                              1268847.02

Threads fairness:
    events (avg/stddev):           1059.7578/51.08
    execution time (avg/stddev):   9.9129/0.06