log/default_128.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 19409.23 qps: 311467.58 (r/w/o: 272524.81/0.00/38942.77) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 11734.98 qps: 187955.21 (r/w/o: 164489.26/0.00/23465.95) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 15147.50 qps: 242283.90 (r/w/o: 211980.90/0.00/30303.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 21269.35 qps: 340222.70 (r/w/o: 297690.99/0.00/42531.71) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 9578.99 qps: 153334.63 (r/w/o: 134172.66/0.00/19161.97) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 12921.58 qps: 206861.74 (r/w/o: 181019.57/0.00/25842.16) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 14163.24 qps: 226565.82 (r/w/o: 198239.34/0.00/28326.48) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 21307.25 qps: 340852.06 (r/w/o: 298241.56/0.00/42610.50) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 10352.13 qps: 165662.17 (r/w/o: 144956.90/0.00/20705.27) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 8757.25 qps: 139907.69 (r/w/o: 122431.06/0.00/17476.62) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2027634
        write:                           0
        other:                           289662
        total:                           2317296
    transactions:                        144831 (14029.01 per sec.)
    queries:                             2317296 (224464.13 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      14029.0083
    time elapsed:                        10.3237s
    total number of events:              144831

Latency (ms):
         min:                                    1.63
         avg:                                    8.84
         max:                                  333.53
         95th percentile:                       19.29
         sum:                              1279862.36

Threads fairness:
    events (avg/stddev):           1131.4922/37.61
    execution time (avg/stddev):   9.9989/0.01